; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image1 - mode
	infrared3 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared3)
	(supports instrument1 image1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared3)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph0)
	(supports instrument3 infrared3)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 infrared3)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument5 infrared3)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star2)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument8 image1)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation1)
	(supports instrument9 image1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet6)
)
(:goal (and
	(pointing satellite0 Phenomenon8)
	(pointing satellite4 Star9)
	(have_image Star5 infrared3)
	(have_image Planet6 spectrograph0)
	(have_image Star7 infrared3)
	(have_image Phenomenon8 image1)
	(have_image Star9 image1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Phenomenon11 spectrograph0)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (turn_to satellite4 groundstation1 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 10
2. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 10
3. (calibrate satellite4 instrument8 groundstation1)
   added: (calibrated instrument8)
   goals met: 0 of 10
4. (turn_to satellite4 phenomenon8 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 phenomenon8)
   goals met: 0 of 10
5. (take_image satellite4 phenomenon8 instrument8 image1)
   added: (have_image phenomenon8 image1)
   goals met: 1 of 10
6. (turn_to satellite4 phenomenon12 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon12)
   goals met: 1 of 10
7. (take_image satellite4 phenomenon12 instrument8 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 2 of 10
8. (turn_to satellite4 phenomenon11 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon11)
   goals met: 2 of 10
9. (take_image satellite4 phenomenon11 instrument8 spectrograph0)
   added: (have_image phenomenon11 spectrograph0)
   goals met: 3 of 10
10. (turn_to satellite4 phenomenon10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon10)
   goals met: 3 of 10
11. (turn_to satellite0 phenomenon8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 10
12. (take_image satellite4 phenomenon10 instrument8 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 5 of 10
13. (turn_to satellite4 planet6 phenomenon10)
   deleted: (pointing satellite4 phenomenon10)
   added: (pointing satellite4 planet6)
   goals met: 5 of 10
14. (take_image satellite4 planet6 instrument8 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 6 of 10
15. (turn_to satellite4 star5 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star5)
   goals met: 6 of 10
16. (take_image satellite4 star5 instrument8 infrared3)
   added: (have_image star5 infrared3)
   goals met: 7 of 10
17. (turn_to satellite4 star7 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star7)
   goals met: 7 of 10
18. (take_image satellite4 star7 instrument8 infrared3)
   added: (have_image star7 infrared3)
   goals met: 8 of 10
19. (turn_to satellite4 star9 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star9)
   goals met: 9 of 10
20. (take_image satellite4 star9 instrument8 image1)
   added: (have_image star9 image1)
   goals met: 10 of 10
